Revit 2026 API

# BalusterPattern Class

---

Baluster pattern class.

SystemObject Autodesk.Revit.DB.ArchitectureBalusterPattern

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class BalusterPattern : IDisposable
```
```vb
Public Class BalusterPattern
	Implements IDisposable
```
```cpp
public ref class BalusterPattern : IDisposable
```
```fsharp
type BalusterPattern =
    class
        interface IDisposable
    end
```

The BalusterPattern type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BreakPattern | The condition which controls breaking baluster patterns distribution. |
|  | DistributionJustification | Determines how baluster pattern distribution is justified. |
|  | EndSpace | The extra space added after a whole baluster pattern. |
|  | ExcessLengthFillBalusterId | The id of a Baluster family used to fill excess length, which is the extra space along the railing segment that cannot be filled with a pattern. If set to InvalidElementId, it will be the default - the id of the BaseRailingAttr containing the Baluster pattern. |
|  | ExcessLengthFillSpacing | The value defines the spacing between each baluster instance inserted in the excess length. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Length | The length of the main baluster pattern. |
|  | PatternAngle | The angle between neighboring railing segments which conditions breaking patterns distribution along a railing path. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the BalusterPattern |
|  | DuplicateBaluster | Duplicates the baluster pointed by given index in the main baluster pattern. |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBaluster | Gets information about the given baluster from the main baluster pattern. |
|  | GetBalusterCount | Gets the number of balusters in the main baluster pattern definition. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | RemoveBaluster | Removes a baluster from the main baluster pattern. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Architecture Namespace